from src import BowClassifier

tmp = '''爆米花　／　4強　出爐　14日　爭冠　軍戰　門票　
爆米花　棒球聯盟　例行賽　今天　結束　，　合作金庫　與　台灣電力　成棒　隊　5屆　賽事　都　打入　4強　，　安永鮮物　今天　以　7　比　1　擊敗　台中　成棒　隊　、　取得　4強　門票　，　新北市　隊　則是　睽違　2年　重返　4強　，　4強　賽　14日　開打　。　
2020年　爆米花　棒球聯盟　賽事　10月　5日　開打　，　今天　例行賽　最後一天　賽程　，　合作金庫　成棒　隊　以　3　比　0　擊敗　台北　興富發　隊　，　例行賽　戰績　17勝　2　敗　、　排名　第一　、　晉級　4強　；　合庫　曾在　2017　、　2018年　完成　爆米花　2　連霸　，　此次　要　挑戰　隊史　爆米花　第　3　冠　。　
台灣電力　成棒　隊　過去　爆米花　最佳　成績　為　季軍　，　昨天　例行賽　以　9　比　5　擊敗　台北　興富發　隊　，　以　例行賽　戰績　15勝　6　敗　、　排名　第　2　、　晉級　4強　。　
新北市　成棒　隊　今天　最終戰　以　2　比　1　擊敗　桃園航空城　隊　，　例行賽　戰績　12勝　7　敗　1　和　、　排名　第　3　晉級　；　新北市　成棒　隊　曾在　2018年　爆米花聯盟　拿下　隊史　最佳　季軍　，　此次　睽違　2年　重返　4強　，　力拚　改寫　隊史　最佳　成績　紀錄　。　
安永鮮物　前身　崇越隼鷹隊　，　是　2014年　首屆　爆米花聯盟　賽事　冠軍　，　安永鮮物　今天　與　台中　成棒　隊　交手　搶勝　，　例行賽　戰績　14勝　11　敗　、　排名　第　4　晉級　。　
爆米花　明後　兩天　為　休兵　日　，　4強　賽　將　於　14日　在　台體大　棒球場　舉行　，　合作金庫　與　安永鮮物　交手　，　台灣電力　與　新北市　隊　碰頭　，　勝隊　取得　冠軍戰　門票　，　冠軍　預計　15日　出爐　。　
'''
tmp = 'null null'
cls = BowClassifier('data/category.json')
print(cls.predict(tmp.split()))